R1 

R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#interface Serial0/0/1
R1(config-if)#ip address 10.0.0.1 255.0.0.0
R1(config-if)#no shutdown
R1(config-if)#exit
R1(config)#interface Serial0/1/0
R1(config-if)#ip address 11.0.0.1 255.0.0.0
R1(config-if)#no shutdown
R1(config-if)#exit
R1# conf t
R1(config)# interface serial 0/1/1
R1(config-if)# bandwidth 64 (represented in kilobits per second)


R2
R2#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#interface Serial0/0/1
R2(config-if)#ip address 10.0.0.2 255.0.0.0
R2(config-if)#no shutdown
R2(config-if)#exit
R2(config)#interface Serial0/0/0
R2(config-if)#ip address 13.0.0.2 255.0.0.0
R2(config-if)#no shutdown
R2(config-if)#exit
R2# conf t
R2(config)#interface serial 0/0/1
R2(config-if)# bandwidth 64 (represented in kilobits per second)
R2# conf t
R2(config)#interface serial 0/0/0
R2(config-if)# bandwidth 64 (represented in kilobits per second)




R3

R3#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#interface Serial0/0/1
R3(config-if)#ip address 12.0.0.2 255.0.0.0
R3(config-if)#no shutdown
R3(config-if)#exit
R3(config)#interface Serial0/0/0
R3(config-if)#ip address 13.0.0.1 255.0.0.0
R3(config-if)#no shutdown
R3(config-if)#exit


R4


R4#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#interface Serial0/0/0
R4(config-if)#ip address 12.0.0.1 255.0.0.0
R4(config-if)#no shutdown
R4(config-if)#exit
R4(config)#interface Serial0/1/0
R4(config-if)#ip address 11.0.0.2 255.0.0.0
R4(config-if)#no shutdown
R4(config-if)#exit
R4# conf t
R4(config)# interface serial 0/0/0
R(config-if)# bandwidth 64 (represented in kilobits per second)

R4# conf t
R4(config)# interface serial 0/1/
R4(config-if)# bandwidth 64 (represented in kilobits per second)


R5 

R5#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R5(config)#interface Serial0/0/0
R5(config-if)#ip address 14.0.0.2 255.0.0.0
R5(config-if)#no shutdown
R5(config-if)#exit
R5(config)#interface Serial0/0/1		
R5(config-if)#ip address 15.0.0.1 255.0.0.0
R5(config-if)#no shutdown
R5(config-if)#exit
R5(config)#interface Serial0/1/0
R5(config-if)#ip address 17.0.0.1 255.0.0.0
R5(config-if)#no shutdown
R5(config-if)#exit
R5(config)#interface Serial0/1/1
R5(config-if)#ip address 19.0.0.1 255.0.0.0
R5(config-if)#no shutdown
R5(config-if)#exit


R5# conf t
R5(config)# interface serial 0/1/1
R5(config-if)# bandwidth 64 (represented in kilobits per second)



R6

R#configure terminal
nter configuration commands, one per line.  End with CNTL/Z.
R6(config)#interface Serial0/0/1
R6(config-if)#ip address 15.0.0.2 255.0.0.0
R6(config-if)#no shutdown
R6(config-if)#exit
R6(config)#interface Serial0/0/0		
R6(config-if)#ip address 16.0.0.1 255.0.0.0
R6(config-if)#no shutdown
R6(config-if)#exit

R6# conf t
R6(config)# interface serial 0/0/1
R6(config-if)# bandwidth 64 (represented in kilobits per second)

R6# conf t
R6(config)# interface serial 0/0/0
R6(config-if)# bandwidth 64 (represented in kilobits per second)





R7

R7#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R7(config)#interface Serial0/0/0
R7(config-if)#ip address 16.0.0.2 255.0.0.0
R7(config-if)#no shutdown
R7(config-if)#exit
R7(config)#interface Serial0/0/1		
R7(config-if)#ip address 18.0.0.1 255.0.0.0
R7(config-if)#no shutdown
R7(config-if)#exit


R8


R8#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R8(config)#interface Serial0/0/0
R8(config-if)#ip address 18.0.0.2 255.0.0.0
R8(config-if)#no shutdown
R8(config-if)#exit
R8(config)#interface Serial0/1/0	
R8(config-if)#ip address 17.0.0.2 255.0.0.0
R8(config-if)#no shutdown
R8(config-if)#exit

R8# conf t
R8(config)# interface serial 0/0/0
R8(config-if)# bandwidth 64 (represented in kilobits per second)

R8# conf t
R8(config)# interface serial 0/1/0
R8(config-if)# bandwidth 64 (represented in kilobits per second)




R9

R9#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R99(config)#interface Serial0/1/1
R9(config-if)#ip address 19.0.0.2 255.0.0.0
R9(config-if)#no shutdown
R9(config-if)#exit
R9(config)#interface Serial0/1/0	
R9(config-if)#ip address 21.0.0.1 255.0.0.0
R9(config-if)#no shutdown
R9(config-if)#exit
R9(config)#interface Serial0/0/1	
R9(config-if)#ip address 20.0.0.1 255.0.0.0
R9(config-if)#no shutdown
R9(config-if)#exit






R10


R10#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R10(config)#interface Serial0/0/0
R10(config-if)#ip address 20.0.0.2 255.0.0.0
R10(config-if)#no shutdown
R10(config-if)#exit
R10(config)#interface Serial0/0/0	
R10(config-if)#ip address 23.0.0.2 255.0.0.0
R10(config-if)#no shutdown
R10(config-if)#exit
R10(config)#interface Serial0/0/1	
R10(config-if)#ip address 23.0.0.2 255.0.0.0
R10(config-if)#no shutdown
R10(config-if)#exit

R10# conf t
R10(config)# interface serial 0/0/0
R1(config-if)# bandwidth 64 (represented in kilobits per second)



R11


R11#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R11(config)#interface Serial0/0/0
R11(config-if)#ip address 23.0.0.1 255.0.0.0
R11(config-if)#no shutdown
R11(config-if)#exit
R11(config)#interface Serial0/0/1	
R11(config-if)#ip address 22.0.0.2 255.0.0.0
R11(config-if)#no shutdown
R11(config-if)#exit
R11# conf t
R11(config)# interface serial 0/0/0
R11(config-if)# bandwidth 64 (represented in kilobits per second)




R12


R2#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R12(config)#interface Serial0/0/0
R12(config-if)#ip address 22.0.0.1 255.0.0.0
R12(config-if)#no shutdown
R12(config-if)#exit
R12(config)#interface Serial0/1/0	
R12(config-if)#ip address 21.0.0.2 255.0.0.0
R12(config-if)#no shutdown
R12(config-if)#exit

R12# conf t
R12(config)# interface serial 0/0/0
R12(config-if)# bandwidth 64 (represented in kilobits per second)

R12# conf t
R12(config)# interface serial 0/1/0
R12(config-if)# bandwidth 64 (represented in kilobits per second)
